kjkent/micropython/ports/esp32/boards/FREENOVE_ESP32S3_CAM/mpconfigboard.h
#ifndef MICROPY_HW_BOARD_NAME
#define MICROPY_HW_BOARD_NAME               "Freenove ESP32S3 Cam (N8R8)"
#endif
#define MICROPY_HW_MCU_NAME                 "ESP32S3"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "s3cam"
